&НаСервере
&После("ПриПолученииКомандПечати")
Процедура ГСК5664_ПриПолученииКомандПечати(Знач ПолноеИмяОбъектаМетаданных, КомандыПечати)
	
	Если ПолноеИмяОбъектаМетаданных <> "Документ.СчетНаОплатуПокупателю" Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ГСК5664_ПечатьСчетОферта";
	КомандаПечати.Идентификатор = "ГСК5664_СчетОферта";
	КомандаПечати.Представление = НСтр("ru = 'Счет-оферта (Конвейер 1С)'");
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 15;
	
КонецПроцедуры
